# افتح الملف وخزنه بمتغير
fh = open('romeo.txt')

# انشاء قائمة فارغة
final_list = []

# استخدام الحلقة للتعامل مع سطور الملف سطرا سطرا
for line in fh:
    # لتقسيم الكلمات في السطر لعناصر في قائمة split استخدم
    words= line.split()
    #استخدم الحلقة مرة أخرى للتعامل مع عناصر القائمة التي تحتوي على الكلمات
    for word in words:
        # اختبر اذا ما كانت الكلمة موجودة في القائمة النهائية أم لا
        if word in final_list:
            # للدوران في الحلقة إذا وجدت الكلمة في القائمة continue استخدم
            continue
        # قم بإضافة الكلمة للقائمة الرئيسية
        final_list.append(word.lower())

# اطبع القائمة مرتبة أبجديا
final_list.sort()
print(final_list)
